t=[1.0, 1.1, 1.2, 1.3, 1.4, 1.5, 1.6, 1.7, 1.8, 1.9, 2.0, 2.1, 2.2, 2.3, 2.4, 2.5, 2.6, 2.7, 2.8, 2.9, 3.0]
#1<=t<=3
y=[-0.814956, 0.150201, 3.17186, 3.38067, -1.51027, 2.0845, 1.89613, 3.64936, 2.84892,
3.9241, -0.583957, 2.85666, 5.68384, -1.01523, 5.37776, 1.97718, -1.22311, 4.71863, 5.72951, -
0.327803, 3.90939]



# 1. Дослідити даний Вам часовий ряд (результати спостережень) на наявність у ньому
# тренду (закономірності).
# 2. Побудувати тренд даного Вам ряду методами згладжування.
# 3. Побудувати тренд даного Вам ряду у вигляді відповідного многочлена.



